Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: ལྷའི་ཚོགས་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་གྲོང་ངམ་གྲོང་ཁྱེར་རམ་གྲོང་རྡལ་ལམ། གཙུག་ལག་ཁང་དེར་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིའོ། །ཇི་ལྟར་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་གི་སྲོག་ལ་ཕན་གདགས་པར་འགྱུར་བ་དང་། འཁོར་བ་ལས་འབྱུང་བ་ཐོབ་པར་འགྱུར་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་གཟའ་དང་། འཐབ་པ་དང་། རྙོག་པ་དང་།
en: “Together with a host of devas, I will end all illness in those villages, towns, marketplaces, and monasteries.

source: བཙས་པའི་སྐར་མའི་གནོད་པ་དང་། རྨི་ལམ་ངན་པ་དང་། ལོག་འདྲེན་གྱི་གནོད་པ་ཐམས་ཅད་དང་། བྱད་དང་། རོ་ལངས་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིའོ། །
en: “I will end harm from planetary afflictions, fighting, and pollution; harm from the stars of one’s birth; and all harm from nightmares, troublesome demons, and all evil spirits and vetālas for the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess this lord of sūtras, so that their lifespan will be benefited and they will abandon saṃsāra, will progress irreversibly to the highest, most complete enlightenment, and will quickly attain the highest, most complete enlightenment of buddhahood.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་མོ་དབྱངས་ཅན་ལ།
en: Then the Bhagavat congratulated the great goddess Sarasvatī, saying, “Well done, well done, great goddess Sarasvatī!

source: ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་ཞུགས་ཏེ།
en: You act to bring benefit to many beings and happiness to many beings.

source: ཁྱོད་ཀྱིས་སྔགས་དང་སྨན་དང་ལྡན་པའི་ཚིག་འདི་འདྲ་བ་བཤད་པ་ནི་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ། །
en: It is excellent, excellent, that you have given this teaching of mantras and medicines.”

source: ལྷ་མོ་དབྱངས་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: The great goddess Sarasvatī bowed down to the Bhagavat’s feet and sat to one side.

source: དེ་ནས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་ལྷ་མོ་དབྱངས་ཅན་དེ་བཀུག་གོ། །ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་མཆོད་འོས་དཀའ་ཐུབ་ཆེ། །འཇིག་རྟེན་ཀུན་ཏུ་རྣམ་གྲངས་མཆོག་སྦྱིན་ཡོན་ཏན་ཆེ། །རྩེར་གནས་མཛེས་མ་དར་བ་རྩྭ་ཡི་གོས་བསྐུས་པ། དར་བ་རྩྭ་ཡི་གོས་གྱོན་རྐང་པ་གཅིག་གིས་གནས། །
en: Then the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, called upon the goddess Sarasvatī: “Great goddess Sarasvatī, You are worthy of offering, a great ascetic; You are renowned in all worlds; You give the best and have great qualities; “You have the highest attainment, are beautiful, And have put on a darbha grass robe— You are wearing darbha grass clothing, And you stand on one leg.

source: ལྷ་རྣམས་ཐམས་ཅད་ལྷགས་ནས་འདི་སྐད་ཅེས་སྨྲས་ཏེ། །སེམས་ཅན་རྣམས་ལ་དགེ་བའི་ཚིག་ཤོད་ལྕེ་ཁྲོལ་ཅིག །སྱཱད་ཡ་ཐེ་དན། མུ་རེ། ཙི་རེ། ཨ་བ་ཛེ། ཨ་བ་ཛ་བ་ཏེ། ཧི་གུ་ལེ། མི་གུ་ལེ། པི་ག་ལ་བ་ཏི། མ་གུ་ཤེ། མ་རི་ཙི། ས་མ་ཏི། ད་ཤ་མ་ཏི། ཨ་གྲི་མ་གྲི། ཏ་ར། ཙི་ཏ་ར། ཙ་པ་ཏི། ཙི་ཙི་རི། ཤི་རི་མི་རི། མ་རི་ཙི། པྲ་ཎ་ཡེ། ལོ་ཀ་ཛྱེཥྛེ། ལོ་ཀ་ཤྲིཥྛེ། ལོ་ཀ་པྲི་ཡེ། སིད་དྷི་པྲི་ཏེ། བི་མ་མུ་ཁི་ཤུ་ཙི་ཁ་རི། ཨ་པྲ་ཏི་ཧ་ཏེ།
en: “All the devas have gathered, And they all speak in one voice: ‘Loosen your tongue and speak The words that will benefit beings.’

source: ཨ་པྲ་ཏེ་ཧ་ཏ། བུད་དྷེ། ན་མུ་ཙི། ན་མུ་ཙི། མ་ཧཱ་དེ་བཱི་པྲ་ཏི་གྲྀཧྣ་ན་མ་སྐ་རཾ།
en: syād yathedaṃ | mure cire | avaje avajavate | higule migule | pigalavati maguśe marici samati daśamati agrimagri tara citara capati cicirī śirimiri marici praṇaye lokajyeṣṭhe lokapriye siddhiprite vimamukhiśucikharī apratihate apratehata buddhe namuci namuci mahādevī pratigṛhnanamaskaraṃ| “May I have unimpeded understanding.

source: བདག་གི་བློ་ཐོགས་པ་མེད་པར་གྱུར་ཅིག །བསྟན་བཅོས་དང་ཚིགས་སུ་བཅད་པའི་རྒྱུད་དང་། སྡེ་སྣོད་དང་སྙན་དངགས་ལ་སོགས་པ་བདག་གི་རིག་སྔགས་དངོས་གྲུབ་ཏུ་གྱུར་ཅིག །ཏདྱ་ཐཱ། མ་ཧཱ་པྲ་བྷ་བཱ།
en: May I accomplish the knowledge of treatises, verses, tantras, piṭakas, poetry, and so on.

source: ཧི་ལི་ཧི་ལི། མི་ལི་མི་ལི། བཅོམ་ལྡན་འདས་མ་ལྷ་མོ་དབྱངས་ཅན་གྱི་མཐུས་བདག་རྣམ་པར་རྒྱལ་བར་གྱུར་ཅིག །ཀ་ར་ཊེ་ཀེ་ཡཱུ་རེ། ཀེ་ཡཱུ་ར་བ་ཏི།
en: tadyathā | mahāprabhavā hili hili mili mili | “May I be victorious through the power of the Bhagavatī, the goddess Sarasvatī.

source: ཧི་ལི་མི་ལི། ཧི་ལི་མི་ལི། ཧི་ལི་ཧི་ལི། སངས་རྒྱས་ཀྱི་བདེན་པ་དང་། ཆོས་ཀྱི་བདེན་པ་དང་།
en: karaṭe keyūre keyūravati hili mili hili mili hili hili | “I summon the great goddess through the truth of the Buddha, the truth of the Dharma, the truth of the Saṅgha, the truth of Indra, and the truth of Varuṇa.

source: དགེ་འདུན་གྱི་བདེན་པ་དང་། དབང་པོའི་བདེན་པ་དང་། ཆུ་ལྷའི་བདེན་པས་ལྷ་མོ་ཆེན་མོ་དགུག་པར་བྱའོ། །གང་དག་འཇིག་རྟེན་ན་བདེན་པ་སྨྲ་བ་དེ་དག་གི་བདེན་པ་དང་བདེན་པའི་ཚིག་གིས་ལྷ་མོ་ཆེན་མོ་དགུག་པར་བྱའོ། །
en: I invoke the great goddess through the truth and true words of all who speak truth in the world.

source: ཏདྱ་ཐཱ། ཧི་ལི་ཧི་ལི། ཧི་ལི་མི་ལི། ཧི་ལི་མི་ལི། བདག་རྣམ་པར་རྒྱལ་བར་གྱུར་ཅིག །
en: tadyathā | hili hili hili mili, hili mili | May I be victorious!

source: བཅོམ་ལྡན་འདས་མ་ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the Bhagavatī, the great goddess Sarasvatī!

source: བདག་ལ་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་གྲུབ་པར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: May I accomplish the mantra words!

source: དེ་ནས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །འབྱུང་པོའི་ཚོགས་རྣམས་ཐམས་ཅད་ང་ལ་ཉན་པར་གྱིས། །
en: svāhā | Then the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, praised the goddess Sarasvatī with these verses: “All hosts of spirits, listen to me!

source: ལྷ་དང་དྲི་ཟ་ལྷ་དབང་བཅས་པའི་འཇིག་རྟེན་ན། །བུད་མེད་དམ་པ་ལྷ་མོ་མཆོག་གི་རབ་གང་ཡིན། །ལྷ་མོ་དམ་པ་མཆོག་ཏུ་མཛེས་པའི་ཞལ་ལ་བསྟོད། །
en: I praise the perfectly beautiful face of the sublime goddess, The sublime female, the highest of perfect goddesses In the world with its devas, gandharvas, and lords of devas. “The one named Sarasvatī is endowed with vast eyes.

source: ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་བསགས་པས་ཡན་ལག་བརྒྱན། །
en: Her limbs are adorned by an accumulation of various qualities.

source: དབྱངས་ཅན་ཞེས་བྱ་སྤྱན་ནི་ཡངས་ཤིང་བསོད་ནམས་འབར། །དྲི་མེད་ཡེ་ཤེས་ཡོན་ཏན་རྣམས་ཀྱིས་རྣམ་པར་རྒྱས། །
en: She shines with merit, a vastness of stainless wisdom and qualities.

source: རིན་ཆེན་སྣ་ཚོགས་ཐ་དད་ལྟ་བུ་བལྟ་བའི་ཕྱིར། །
en: She is like a vision of an accumulation of different jewels.

source: མཆོག་རབ་ངག་གི་ཡོན་ཏན་ཁྱད་པར་དེ་བསྟོད་དོ། །
en: “I praise her, who has the exceptional qualities of supreme speech.

source: དམ་པ་མཆོག་གི་དངོས་གྲུབ་བྱེད་པ་དང་། །
en: She produces the supreme, sublime accomplishments.

source: ཡང་དག་བསྔགས་དང་ཡོན་ཏན་བྱེད་པ་དང་། །
en: She produces true praises and good qualities.

source: དྲི་མེད་མཆོག་དང་པདྨ་འབར་བ་དང་། །
en: She is stainlessly supreme, a shining lotus.

source: མིག་མཆོག་དང་ནི་མིག་གི་དམ་པ་དང་། །
en: “She has supreme eyes, sublime eyes.

source: དགེ་བའི་གནས་དང་དགེ་བ་མཐོང་བ་དང་། །
en: She is the basis for goodness, a vision of goodness.

source: ཡོན་ཏན་བསམ་དུ་མེད་པས་བརྒྱན་པ་དང་། །
en: She is adorned with inconceivable qualities.

source: ཟླ་བ་འདྲ་དང་དྲི་མ་མེད་འོད་དང་། །
en: She is like the moon shining with pure light.

source: ཡེ་ཤེས་འབྱུང་གནས་དྲན་པ་དམ་པ་དང་། །
en: “She is the source of wisdom and has sublime memory.

source: སེང་གེ་མཆོག་དང་མི་ལ་ཞོན་པ་དང་། །
en: She is a supreme lion, the divine steed of humans.

source: ལག་པ་བརྒྱད་རྣམས་ཀྱིས་ནི་བརྒྱན་པ་དང་། །ཟླ་བ་ཉ་བ་ལྟ་བུར་སྣང་བ་དང་། །
en: She is adorned by eight arms And she shines like the full moon.

source: ཡིད་དུ་འོང་བའི་ངག་དང་དབྱངས་སྙན་དང་། །
en: “She has a beautiful voice and lovely speech.

source: ཤེས་རབ་ཟབ་མོ་དང་ནི་ལྡན་པ་དང་། །
en: She is endowed with profound wisdom.

source: དགོས་མཆོག་སྒྲུབ་བྱེད་སེམས་ཅན་དམ་པ་དང་། །
en: She is a sublime being who provides the highest needs.

source: ལྷ་དང་ལྷ་མིན་དབང་པོས་མཆོད་པ་དང་། །ལྷ་དང་ལྷ་མིན་ཚོགས་ཀུན་གནས་བརྗོད་དང་། །འབྱུང་པོའི་ཚོགས་ཀྱི་གནས་རྟག་མཆོད་པའི་ཕྱིར་སྭཱ་ཧཱ། །
en: Her abode is praised by all the hosts of deva and asura lords, And she is continually offered to by the hosts of spirits: svāhā.

source: བདག་ཅག་ལྷ་མོ་འདི་ལ་ཕྱག་བྱའོ། །
en: “I pay homage to this goddess.

source: བདག་ལ་ཡོན་ཏན་ཁྱད་པར་ཀུན་སྩོལ་ཅིག །
en: May she bestow special qualities on me.

source: དགོས་པ་ཀུན་ཏུ་བདག་ལ་དངོས་གྲུབ་སྩོལ། །
en: May she grant me the accomplishment of all that is needed.

source: དགྲ་རྣམས་ཁྲོད་ན་བདག་ལ་རྟག་ཏུ་སྲུངས། །
en: May she constantly protect me in the midst of enemies.

source: ཡི་གེ་རྫོགས་ཤིང་ཚིག་རྒྱས་འདི་དག་ནི། །ནང་པར་ལངས་ནས་གཙང་མར་བརྗོད་པར་བྱ། །བསམ་པ་དང་ནི་ནོར་འབྲུ་ཐམས་ཅད་རྙེད། །དངོས་གྲུབ་དགེ་བ་རྒྱ་ཆེན་ཐོབ་པར་འགྱུར། །
en: “In the morning on arising, recite purely These complete syllables, the full words, And all wishes, wealth, and grain will be attained, And vast accomplishment and goodness will also be obtained.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། དབྱངས་ཅན་གྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བརྒྱད་པའོ།། །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ལྷ་མོ་ཆེན་མོ་དཔལ་བདག་གིས་ཀྱང་། ཅི་ནས་ཆོས་སྨྲ་བའི་དགེ་སློང་དེ་ཡོ་བྱད་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་། བྲེལ་ཕོངས་མ་མཆིས་པ་ཐོབ་པར་འགྱུར་བ་དང་། སེམས་བརྟས་པར་འགྱུར་བ་དང་། སེམས་བདེ་བར་གདུགས་མཚན་བས་པར་འགྱུར་བ་དང་། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཚིག་དང་ཡི་གེ་རྣམ་པ་ཐ་དད་པ་དག་ཆུབ་པར་འགྱུར་བ་དང་། རྣམ་པར་རྟོགས་པར་འགྱུར་བ་དང་། ཡང་དག་པར་བརྗོད་པར་འགྱུར་བ་དང་།
en: This concludes “Sarasvatī,” the eighth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: སངས་རྒྱས་བརྒྱ་སྟོང་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་དེ་དག་གི་དོན་གྱི་སླད་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛམ་བུའི་གླིང་དུ་ཡུན་རིང་དུ་གནས་པར་འགྱུར་ཞིང་། མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ཀྱང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པར་འགྱུར་བ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་ལྷ་དང་མིའི་བདེ་བ་མྱོང་བར་འགྱུར་བ་དང་།
en: Chapter 9: The Great Goddess Śrī Then the great goddess Śrī said to the Bhagavat, “Venerable Bhagavat, I, the great goddess Śrī, will also, in whatever way, bring a perfection of requisites to those dharmabhāṇaka bhikṣus so that they will gain freedom from deprivation; will have a resolute mind; will day and night have happiness of mind; will learn, understand, and correctly recite all the different words and letters in this Lord King of Sūtras, the Sublime Golden Light, so that, for the sake of those beings who have planted good roots with hundreds of thousands of buddhas, this Lord King of Sūtras, the Sublime Golden Light will remain for a long time in Jambudvīpa and will not disappear, and so that beings will hear this Lord King of Sūtras, the Sublime Golden Light and will experience the happiness of devas and humans for many hundreds of thousands of quintillions of eons, and so that there will be no famine and instead excellent harvests.

source: མུ་གེ་མ་མཆིས་པར་འགྱུར་བ་དང་། ལོ་ལེགས་པར་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ཀྱང་བདེ་བར་སྦྱར་བ་ཐམས་ཅད་ཀྱིས་བདེ་བར་འགྱུར་བ་དང་།
en: Beings will become happy through being endowed with every kind of happiness.

source: དེ་བཞིན་གཤེགས་པ་དང་འགྲོགས་པར་འགྱུར་བ་དང་། མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དང་།
en: They will be in the company of tathāgatas, and in a future time will attain the highest, most complete enlightenment of buddhahood.

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཤིན་ཏུ་ཆད་པར་འགྱུར་བ་གང་འདི་གོས་དང་། ཟས་དང་།
en: This will end all the suffering in the hells, in the lives of animals, and in the world of Yama.

source: མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་དང་། འཚོག་ཆས་གཞན་དག་གིས་ཀྱང་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་སྤྲོ་བར་བགྱིའོ། །
en: Robes, food, bedding, medicine while ill, requisites, and other necessities will be brought to those dharmabhāṇaka bhikṣus.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་མེ་ཏོག་ཡོན་ཏན་རྒྱ་མཚོ་བཻ་ཌཱུརྱ་དང་། གསེར་གྱི་རི་ཁ་དོག་བཟང་པོ་གསེར་དུ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་དེ་ལ་ལྷ་མོ་ཆེན་མོ་དཔལ་གྱིས་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ།
en: “I, the great goddess Śrī, developed good roots with the tathāgata arhat samyak­saṃbuddha Ratna­kusuma­guṇa­sāgara­vaiḍūrya­kanaka­giri­suvarṇa­kāñcana­prabhāsa­śrī.

source: དེས་ད་ལྟར་ཕྱོགས་གང་དང་གང་དུ་སེམས་པ་དང་། ཕྱོགས་གང་དང་གང་དུ་ལྟ་བ་དང་། ཕྱོགས་གང་དང་གང་དུ་འགྲོ་བའི་ཕྱོགས་དེ་དང་དེར་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་བདེ་བར་སྦྱར་བ་ཐམས་ཅད་ཀྱིས་བདེ་བར་འགྱུར། ཟས་དང་། སྐོམ་དང་།
en: In the present, wherever I direct my mind, wherever I look, wherever I go, many hundreds of thousands of quintillions of beings become happy; they become endowed with every kind of happiness.

source: ནོར་དང་། འབྲུ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་།
en: They do not lack food, drink, wealth, grain, cowries, gold, jewels, pearls, beryl, conchs, crystals, coral, silver, unwrought gold, or other requisites.

source: བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་དང་། ཡོ་བྱད་གཞན་དག་གིས་ཀྱང་མི་ཕོངས་པར་འགྱུར། སེམས་ཅན་དེ་དག་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་འབྱོར་པར་འགྱུར་རོ། །
en: Those beings are endowed with all requisites.

source: ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་མཐུས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པར་བྱ།
en: Through the power of the great goddess Śrī, they make offerings to that tathāgata.

source: སྤོས་དང་མེ་ཏོག་དང་བདུག་པ་ཡང་དབུལ་བར་བྱ།
en: They make offerings of perfumes, flowers, and incense.

source: ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་མིང་ནས་ལན་གསུམ་བརྗོད་ཅིང་དེ་ལ་སྤོས་དང་།
en: They recite the name ‘the great goddess Śrī’ three times and offer him perfume, incense, and flowers.

source: བདུག་པ་དང་མེ་ཏོག་ཀྱང་བྱིན་ལ་རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱང་བྱིན་ན་དེའི་འབྲུའི་ཕུང་པོ་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: They also offer him a variety of flavors, and then their great accumulations of grain increase.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། ས་ལ་ས་ཡི་བཅུད་དག་རྣམ་པར་འཕེལ། །
en: It is said concerning this: “The fertility of the earth increases in the earth.

source: ལྷ་རྣམས་རྟག་པར་རབ་ཏུ་དགའ་བར་འགྱུར། །
en: The devas will be constantly, perfectly happy.

source: འབྲས་བུ་ལོ་ཏོག་ལྡུམ་སྡོང་ལྗོན་ལྷ་རྣམས། །ལོ་ཏོག་ཤིན་ཏུ་སྣ་ཚོགས་རྣམས་ཀྱང་བསྐྱེད། །
en: The deities of fruits, harvests, plants, and trees Cause a great variety of harvests to arise.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོའི་མིང་བརྗོད་པའི་སེམས་ཅན་དེ་དག་ལ་ལྷ་མོ་ཆེན་མོ་དཔལ་སེམས་པར་འགྱུར། དེ་དག་ལ་དཔལ་ཆེན་པོར་བྱེད་པར་འགྱུར་རོ། །
en: “I, the great goddess Śrī, will direct my mind toward those beings who say the name of The Lord King of Sūtras, the Sublime Golden Light and I will create a great splendor for them.

source: ལྷ་མོ་ཆེན་མོ་དཔལ་ནི་ལྕང་ལོ་ཅན་གྱི་ཕོ་བྲང་འཁོར་ན་སྐྱེད་མོས་ཚལ་དམ་པ་བསོད་ནམས་ཀྱི་མེ་ཏོག་འོད་ཅེས་བྱ་བ་ན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཁང་པ་དམ་པ་གསེར་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ན་གནས་ཏེ། མི་གང་ལ་ལ་འབྲུའི་ཕུང་པོ་སྤེལ་བར་འདོད་པ་དེས་རང་གི་ཁྱིམ་ཕྱག་དར་ལེགས་པར་བྱ།
en: “The great goddess Śrī dwells in a palace called Suvarṇadhvaja that is made of the seven precious materials in the sublime park called Puṇya­kusuma­prabha in the environs of the palace of Alakāvati.

source: ཁྲུས་ལེགས་པར་བྱ། གོས་དཀར་པོ་གཙང་མ་བགོ་བར་བྱ། གོས་དྲི་རབ་ཏུ་ཞིམ་པ་བགོ་བར་བྱའོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་མེ་ཏོག་ཡོན་ཏན་རྒྱ་མཚོ་བཻ་ཌཱུརྱ་དང་། གསེར་གྱི་རི་ཁ་དོག་བཟང་པོ་གསེར་དུ་སྣང་བའི་དཔལ་དེ་ལ་ཕྱག་འཚལ་ཞིང་མཚན་ནས་ཀྱང་ལན་གསུམ་བརྗོད།
en: Any person who wishes to increase their accumulation of grain should clean their house well, wash well, wear clean white clothes, wear clothes that have been perfumed, bow down to the tathāgata arhat samyaksaṃbuddha Ratna­kusuma­guṇa­sāgara­vaiḍūrya­kanaka­giri­suvarṇa­kāñcana­prabhāsa­śrī, and say his name three times.

source: ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་ལག་ནས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བྱེད།
en: Then the great goddess Śrī will make an offering with her own hands.

source: མེ་ཏོག་དང་བདུག་པ་དང་སྤོས་ཀྱང་དབུལ།
en: Flowers, incense, and perfume should also be offered.

source: རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱང་དབུལ།
en: Various kinds of flavors should also be offered.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོའི་མིང་ཡང་ལན་གསུམ་བརྗོད། བདེན་པའི་ཚིག་ཀྱང་བརྗོད།
en: The name of The Lord King of Sūtras, the Sublime Golden Light should be recited three times and words of truth recited.

source: ལྷ་མོ་ཆེན་མོ་དཔལ་ལ་ཡང་མཆོད་ཅིང་མེ་ཏོག་དང་བདུག་པ་ཡང་འབུལ།
en: Also, offerings should be made to the great goddess Śrī.

source: རོ་བྲོ་བ་སྣ་ཚོགས་ཀྱང་འབུལ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་མཐུས། དེའི་ཚེ་ལྷ་མོ་ཆེན་མོ་དཔལ་ཁྱིམ་དེ་ལ་སེམས་པར་འགྱུར། དེའི་འབྲུའི་ཕུང་པོ་ཆེན་པོ་ཡང་འཕེལ་བར་འགྱུར་རོ། །
en: When flowers and incense are offered, and various kinds of flavors are offered, at that time, through the power of this lord king of sūtras, the great goddess Śrī will turn her mind toward that house and its great accumulation of grain will increase.

source: ལྷ་མོ་ཆེན་མོ་དཔལ་དགུག་པར་འདོད་པ་དེས་རིག་པའི་གསང་སྔགས་འདི་དག་དྲན་པར་བྱའོ། །འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Those who wish to invoke the great goddess Śrī should remember these mantras: “ ‘I pay homage to all the buddhas of the past, the future, and the present.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘I pay homage to all the buddhas and bodhisattvas.

source: བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘I pay homage to the bodhisattvas such as Maitreya.

source: དེ་དག་ལ་ཕྱག་འཚལ་ནས། རིག་པ་འདི་དག་ལ་སྦྱོར་བར་བྱ་སྟེ། རིག་སྔགས་འདི་རྣམས་བདག་ལ་འབྱོར་བར་གྱུར་ཅིག །སྱཱད་ཡ་ཐེ་དན། པྲ་ཏི་པཱུ་ར་ཎ་བཱ་རེ། ས་མནྟ་དར་ཤ་ནེ། མ་ཧཱ་བི་ཧ་ར་ག་ཏེ། ས་མནྟ། བེ་ད་ན་ག་ཏེ།
en: “ ‘Having paid homage to them, I will practice this mantra.

source: མ་ཧཱ་ཀཱརྱཾ་པྲ་ཏི་པྲ་བ་ཎེ། སཏྭ་ཨརྠ་ས་མཾ་ཏཱ་ནུ་པྲ་པཱུ་རེ། ཨཱ་ཡཱ་ན་དྷརྨ་ཏཱ་མ་ཧཱ་བྷོ་གི་ནེ། མ་ཧཱ་མཻ་ཏྲེ་ཨུ་པ་སཾ་ཧི་ཧེ། ཧེ་ཏཻ་ཥི།
en: “ ‘This vidyāmantra will bring me wealth: syād yathedam pratipūrṇavare samanta­vedanagate mahākāryapratiprāpaṇe sattvārtha­samatānuprapūre ayānadharmatā mahābhogine mahāmaitre upasaṃhihe saṃgṛhīte samarthānupālane | “These are words with an infallible meaning.

source: སཾ་གྲ་ཧི་ཏེ་ཏེ་ས་མར་ཐཱ་ནུ་པཱ་ལཱ་ནི། འདི་དག་ནི་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་ཆོས་ཉིད་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་གཅིག་ཏུ་དེ་ཁོ་ན་ཡང་དག་པར་སྒྲུབ་པར་སྦྱིན་པ་མི་སླུ་བའི་དོན་གྱི་ཚིག་སྟེ།
en: That single-sentence mantra has the nature of an empowerment bestowed upon the crown of the head and bestows the valid accomplishment of the true nature.

source: སེམས་ཅན་བར་མ་ལ་སྦྱོར་བ་རྣམས་དགེ་བའི་རྩ་བ་ཁ་ན་མ་ཐོ་བ་མེད་པ་དག་གིས་ལོ་བདུན་དུ་འདོན་ཅིང་འཛིན་པ་དག་ཡན་ལག་བརྒྱད་པའི་བསྙེན་པར་གནས་པ་ལ་བསྙེན་ཏེ།
en: “The practice for beings of middling capacity is to possess and recite this while keeping the eight vows for seven years without transgressions but only roots of merit.

source: བདག་དང་སེམས་ཅན་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་སྔ་དྲོ་དང་ཕྱི་དྲོ་སངས་རྒྱས་ཐམས་ཅད་ལ་མེ་ཏོག་དང་སྤོས་རྣམས་ཀྱིས་མཆོད་ནས། དེས་བདག་གི་བསམ་པ་འདི་འབྱོར་པར་གྱུར་ཅིག །མྱུར་དུ་འབྱོར་པར་གྱུར་ཅིག །
en: In order for themselves and others to perfect omniscient wisdom, morning and afternoon make offerings of flowers and incense to all buddhas, and pray, ‘May I fulfill this wish of mine, may I fulfill it quickly.’

source: གཙུག་ལག་ཁང་ངམ་དགོན་པའི་གནས་ཀྱང་རུང་སྟེ། ཁྱིམ་དེ་ཤིན་ཏུ་གཙང་མར་བྱས་ལ་ལྕི་བས་དཀྱིལ་འཁོར་བྱས་ཏེ།
en: “In a temple or in a solitary place, clean the building and make a circle of dung.

source: སྤོས་དང་བདུག་པ་ཡང་དབུལ་བར་བྱ།
en: Offer perfume and incense.

source: སྟན་གཙང་མ་ཡང་གདིང་བར་བྱའོ། །ས་ལ་མེ་ཏོག་སིལ་མ་བཀྲམ་ནས་བསྡད་པར་བྱའོ། །
en: Arrange a clean seat, scatter flower petals on the ground, and then sit on it.

source: དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་དཔལ་འོངས་ནས་དེར་གནས་པར་འགྱུར་རོ། །དེ་ཕྱིན་ཅད་ཁྱིམ་མམ།
en: “Then, in that instant, the great goddess Śrī will come and reside there.

source: གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། གཙུག་ལག་ཁང་ངམ། དགོན་པའི་གནས་སུ་ནམ་ཡང་བྲེལ་ཅིང་ཕོངས་པ་མེད་པར་བྱེད་དོ། །འགྲོན་བུ་དང་། གསེར་དང་།
en: From then on, that house, village, town, market town, temple, or place of solitude will never be disturbed and never be in need.

source: རིན་པོ་ཆེ་དང་། ནོར་དང་། འབྲུ་དང་། ཡོ་བྱད་ཐམས་ཅད་འབྱོར་པ་དང་། བདེ་བར་སྦྱར་བ་ཐམས་ཅད་ཀྱིས་བདེ་བར་འགྱུར་རོ། །
en: Everyone will obtain cowries, gold, jewels, wealth, grain, and all utensils; they will become happy through all that brings happiness.

source: དགེ་བའི་རྩ་བ་གང་དག་བྱེད་པ་དེ་དག་ཐམས་ཅད་ལས་ལྷ་མོ་ཆེན་མོ་དཔལ་ལ་ཤས་ཀྱི་མཆོག་སྦྱིན་པར་བྱ་སྟེ། དེས་ན་དེ་ཇི་སྲིད་འཚོའི་བར་དུ་དེ་ན་གནས་པར་འགྱུར། ཕོངས་པར་མི་འགྱུར།
en: “Whatever good actions have been done, give the supreme part to the great goddess Śrī, and because of that she will remain with you for as long as you live and will never abandon you.

source: དེ་དག་གི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: All your aspirations will be completely fulfilled.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། ལྷ་མོ་ཆེན་མོ་དཔལ་གྱི་ལེའུ་ཞེས་བྱ་བ་སྟེ་དགུ་པའོ།། །།
en: This concludes “The Great Goddess Śrī,” the ninth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་ཕྱག་འཚལ་ལོ། །
en: Chapter 10: Dṛḍhā, the Goddess of the Earth “I pay homage to the Bhagavat Tathāgata Ratnaśikhin.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་འབར་བ་རིན་ཆེན་གསེར་གྱི་འོད་ཟེར་སྣང་བའི་ཏོག་ལ་ཕྱག་འཚལ་ལོ། །དེ་བཞིན་གཤེགས་པ་འཛམ་བུ་གསེར་གྱི་རྒྱལ་མཚན་གསེར་དུ་སྣང་བ་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Bhagavat Tathāgata Vimalajvala­ratna­suvarṇa­raśmi­prabhā­śikhin “I pay homage to the Tathāgata Jambu Golden Victory Banner Golden Appearance.

source: དེ་བཞིན་གཤེགས་པ་གསེར་དུ་སྣང་བའི་སྙིང་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Tathāgata Suvarṇa­prabhagarbha.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མ་བརྒྱའི་འོད་ཟེར་སྣང་བའི་སྙིང་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Tathāgata Radiance of a Hundred Suns’ Illuminating Essence.

source: དེ་བཞིན་གཤེགས་པ་གསེར་རིན་ཆེན་འབྱུང་གནས་གདུགས་བརྩེགས་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Tathāgata Suvarṇa­ratnākaracchatra­kūṭa.

source: དེ་བཞིན་གཤེགས་པ་གསེར་གྱི་མེ་ཏོག་འབར་བའི་འོད་ཟེར་གྱི་ཏོག་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Tathāgata Suvarṇa­puṣpa­jvalaraśmi­ketu.

source: དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་ཆེན་མོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Tathāgata Mahāpradīpa.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the Tathāgata Ratnaketu. “I pay homage to the bodhisattva Ruciraketu.

source: བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་ཅེས་བྱ་བ་དང་།
en: “I pay homage to the bodhisattva Suvarṇa­prabhāsottama.

source: བྱང་ཆུབ་སེམས་དཔའ་གསེར་འོད་དམ་པ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གསེར་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་དང་།
en: “I pay homage to the bodhisattva Golden Essence.

source: བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ངུ་ཞེས་བྱ་བ་དང་།
en: “I pay homage to the bodhisattva Sadāprarudita.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འཕགས་ཞེས་བྱ་བ་དང་།
en: “I pay homage to the bodhisattva Dharmodgata.

source: ཤར་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ཞེས་བྱ་བ་དང་།
en: “I pay homage to the Tathāgata Akṣobhya in the east.

source: ལྷོ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་ཅེས་བྱ་བ་དང་།
en: “I pay homage to the Tathāgata Ratnaketu in the south.

source: ནུབ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཅེས་བྱ་བ་དང་།
en: “I pay homage to the Tathāgata Amitāyus in the west.

source: བྱང་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་རྔ་སྒྲ་ཞེས་བྱ་བ་སྟེ།
en: “I pay homage to the Tathāgata Dundubhisvara in the north.

source: སུ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་དེ་བཞིན་གཤེགས་པའི་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའི་མིང་འདི་དག་འཛིན་ཏམ། ཀློག་གམ། ཁོང་དུ་ཆུད་པར་བྱེད་ན་དེ་རྟག་ཏུ་ཚེ་རབས་དྲན་པར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་སའི་ལྷ་མོ་བརྟན་མས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Whoever possesses, reads, or learns these names of the tathāgatas and the names of the bodhisattvas from this Lord King of Sūtras, the Sublime Golden Light will remember their past lives.”
